{
    "3.2.6": "🧹 向量化文本清洗：新增文本清洗模块，向量化前自动移除 HTML/思考标签/OOC 等无关内容<br>🔄 自动向量化：支持累积消息自动触发向量化，可配置触发阈值<br>👁️ 清洗效果预览：向量索引面板新增「预览清洗效果」功能，查看原文与清洗后对比<br>📊 统计栏优化：主界面字数统计改为紧凑水平条样式，新增模型名称显示",
    "3.2.5": "🔄 流式重试机制：流式请求失败自动重试1次，减少 Stream Interrupted 错误<br>📖 世界书更新增强：智能提取支持更新现有条目，提供原有内容对比和多种保存模式<br>🛡️ 页面加载保护：智能提取页面加载操作添加8秒超时保护，避免卡死<br>🔧 增量向量化修复：修复增量更新时重复索引问题",
    "3.2.4": "🧠 智能总结：AI 分析对话历史生成角色总结，支持语义检索增强<br>📊 向量索引管理：Embedding API 独立配置，支持向量索引构建/导入/导出<br>🔘 快捷工具栏：悬浮球点击展开横向工具栏，可自定义显示按钮<br>⚡ 快速切换模型：工具栏新增模型切换弹窗，支持模型覆盖",
    "3.2.3": "🧠 智能设定提取：AI 分析对话内容自动提取世界观设定，审核后导入世界书<br>⭐ 收藏夹增强：支持批量删除、重命名收藏条目<br>🎯 悬浮菜单重设计：水平图标栏布局，新增设置快捷入口<br>📜 场景历史队列：保存最近使用的场景，快速切换",
    "3.2.2": "🎨 CSS 主题方案管理：支持保存多个自定义 CSS 主题，随时切换<br>📊 审查窗口实时显示自定义系统提示词<br>🔧 修复剧本管理器分类滚动和筛选问题<br>📝 大屏编辑模式优化：防止误触关闭丢失内容。",
    "3.2.1": "🔒 导入前自动备份：导入备份时自动下载当前数据，防止误操作覆盖<br>📚 新增 User Persona 世界书支持：获取用户角色绑定的世界书条目<br>💾 修复数据备份功能：使用立即保存确保数据持久化<br>🔧 悬浮球移除强制贴边吸附：可自由拖动到任意位置",
    "3.2.0": "📜 新增自定义系统提示词：可分别为「内容优先」和「氛围美化」模式自定义系统提示词<br>⏹️ 侧边滑出式中止按钮：生成时悬浮球右侧展开中止按钮，操作更便捷<br>🎨 计时器毛玻璃样式：生成计时器改为透明毛玻璃效果<br>⚡ 设置页切换动画优化：移除淡入动画，响应更即时",
    "3.1.9": "💾 新增数据备份功能：支持完整导出/导入所有插件数据（含API配置、脚本、收藏等）<br>🔧 修复审查窗口聊天历史白名单：现与实际生成保持一致，正确显示过滤后的内容<br>⏹️ 侧边滑出式中止按钮：生成时悬浮球上方展开中止按钮",
    "3.1.8": "🚀 新增双入口系统：左侧菜单添加插件主入口（始终可用），悬浮球作为辅助入口（可在设置中隐藏）<br>🛡️ 修复隐藏消息过滤：使用 is_system 属性正确识别系统消息<br>✍️ 新增内容编辑工具：支持直接编辑已生成的 HTML 内容<br>📖 沉浸阅读模式：Zen 模式隐藏UI元素，专注内容阅读",
    "3.1.7": "🔧 优化筛选键下拉列表：固定最大高度，超过5个分类时显示滚动条<br>📏 修复插件字体大小受ST全局设置影响的问题",
    "3.1.6": "📚 世界书选择器增强：世界书标题右侧添加「全选」按钮，点击可快速全选/取消该分组所有条目<br>🔄 优化更新流程：点击「去更新」按钮现在直接打开 ST 扩展管理器，更加可靠",
    "3.1.5": "📚 世界书选择器优化：世界书分组可折叠、条目添加预览按钮查看完整内容<br>📝 聊天历史提取白名单：可自定义只提取指定标签内的文本作为历史上下文",
    "3.1.4": "⚡ 新增「强制覆盖内联字体」选项：开启后自定义字体将使用 !important 覆盖模型生成的内联 font-family 样式",
    "3.1.3": "🔧 修复更新功能报错问题（优化 API 响应处理，兼容不同 SillyTavern 版本）",
    "3.1.2": "🔤 修复自定义字体在渲染区域不生效的问题（Shadow DOM 内注入字体定义）",
    "3.1.1": "🐛 修复更新弹窗无法显示更新日志的问题（现从远程获取 changelog.json）<br>🔧 修复 Base64 解码 UTF-8 中文乱码问题",
    "3.1.0": "🔤 全局字体设置：支持系统默认、在线字体(@import)、本地上传(.woff2/.ttf)三种字体来源<br>🎨 简化字体配置：统一为单一全局字体变量，代码编辑器保持等宽字体",
    "3.0.9": "🎨 新增自定义主题样式：设置中新增「主题样式」页，支持自定义 CSS 覆盖默认样式，提供常用选择器参考<br>🔧 悬浮球透明度控制：边框和背景色均支持 0-100% 透明度调节<br>📐 渲染区域优化：移除 Shadow DOM 内容区域默认内边距，生成内容可完全填充<br>🐛 修复移动端分类重命名和批量移动剧本问题",
    "3.0.8": "🎮 互动剧本增强：检测到互动内容时显示浮动按钮(FAB)，支持新窗口体验和导出HTML<br>🎲 新增宏处理支持：剧本提示词现支持 {{random::A::B::C}} 等 ST 内置宏<br>📂 剧本管理器优化：移除自定义排序，移动端新增下拉选择器<br>🔧 修复批量移动剧本后原分类仍保留问题<br>📊 审查窗口同步显示处理后的提示词",
    "3.0.7": "🛡️ 安全性升级：采用 iframe 沙箱隔离渲染，修复交互失效问题<br>🔄 自动更新优化：扩展栏新增版本检测与一键更新功能<br>✍️ 自动续写增强：优化上下文拼接策略，智能去重，提升长文连贯性<br>🐛 修复已知 Bug",
    "3.0.6": "🔗 修复「跟随ST主连接」功能：现通过 ST 后端代理发送请求，支持所有 API 源和反向代理<br>🎬 导演模式改为自由编辑区域，可自定义任意指令<br>✍️ 新增文笔参考多方案功能（最多10个）<br>📚 世界书空条目确认对话框<br>⚡ 插件加载优化",
    "3.0.5": "📖 新增双模式切换（内容优先/氛围美化）<br>📚 修复世界书获取问题<br>❤️ 支持取消收藏<br>🎨 优化悬浮球样式"
}